---
kind: method
id: M:Autodesk.Revit.DB.RenderingSettings.SetRenderingImageExposureSettings(Autodesk.Revit.DB.RenderingImageExposureSettings)
source: html/427592f3-91cb-031c-9532-0abff072ddcc.htm
---
# Autodesk.Revit.DB.RenderingSettings.SetRenderingImageExposureSettings Method

Changes the rendering image exposure settings.

## Syntax (C#)
```csharp
public void SetRenderingImageExposureSettings(
	RenderingImageExposureSettings exposure
)
```

## Parameters
- **exposure** (`Autodesk.Revit.DB.RenderingImageExposureSettings`) - An instance of the new rendering image exposure settings.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null